ToDo/app/controllers/proyects_controller.rb

SELECT * FROM "proyects" WHERE (proyects.name LIKE '%#<Proyect:0xb5e76674>%' AND proyects.name LIKE '%#<Proyect:0xb5e765fc>%') ORDER BY proyects.name ASC
---
  def index
   @proyects= Proyect.name_like_all(@proyects).ascend_by_name
   @search = Proyect.search(params[:search])

SELECT * FROM "proyects" WHERE ("proyects"."id" = 1)
---
  def show
    @proyect = Proyect.find(params[:id])

SELECT * FROM "proyects" WHERE ("proyects"."id" = 1)
---
  def edit
    @proyect = Proyect.find(params[:id])

INSERT INTO "proyects" ("name", "created_at", "avatar_file_name", "avatar_file_size", "updated_at", "avatar_content_type", "avatar_updated_at") VALUES('Ayudas', '2010-05-08 21:42:25', NULL, NULL, '2010-05-08 21:42:25', NULL, NULL)
---
  def create
    @proyect = Proyect.new(params[:proyect])
    respond_to do |format|
      if @proyect.save

SELECT * FROM "proyects" WHERE ("proyects"."id" = 2)
UPDATE "proyects" SET "updated_at" = '2010-05-07 20:10:51', "avatar_file_size" = 353246, "avatar_file_name" = 'grizzly-bear-cubs-072509-xl.jpg', "avatar_updated_at" = '2010-05-07 20:10:51', "avatar_content_type" = 'image/jpeg' WHERE "id" = 2
---
  def update
    @proyect = Proyect.find(params[:id])

    respond_to do |format|
      if @proyect.update_attributes(params[:proyect])

SELECT * FROM "proyects" WHERE ("proyects"."id" = 3)
DELETE FROM "proyects" WHERE "id" = 3
---
  def destroy
    @proyect = Proyect.find(params[:id])
    @proyect.destroy