ToDo/app/controllers/tasks_controller.rb

  def index
    @tasks = @proyect.tasks
    @search = @tasks.search(params[:search])
---
SELECT "tasks".* FROM "tasks" INNER JOIN "priorities" ON "priorities".id = "tasks".priority_id WHERE (((tasks.priority_id = 4) AND (tasks.description LIKE '%Añadir colores%')) AND ("tasks".proyect_id = 1)) ORDER BY priorities.value DESC

  def show
    @task = @proyect.tasks.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1 AND ("tasks".proyect_id = 1))

  def create
    @task = @proyect.tasks.build(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "priority_id", "notes", "updated_at", "due_date", "description", "proyect_id") VALUES('2010-05-07 16:56:52', 4, 'Azul, blanco, negro', '2010-05-07 16:56:52', '2010-05-07 16:56:00', 'Añadir colores', 1)